Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
/*********************************************************************************************************//**
 * @file    ht32f175x_275x_mctm.c
 * @version V1.0
 * @date    09/08/2011
 * @brief   This file provides all the MCTM firmware functions.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f175x_275x_mctm.h"
#include "ht32f175x_275x_rstcu.h"

/** @addtogroup HT32F175x_275x_Peripheral_Driver HT32F175x/275x Peripheral Driver
  * @{
  */

/** @defgroup  MCTM MCTM
  * @brief MCTM driver modules
  * @{
  */

/** @defgroup MCTM_Private_TypesDefinitions MCTM private types definitions
  * @{
  */
/**
  * @}
  *//* End of MCTM_Private_TypesDefinitions group */

/** @defgroup MCTM_Private_Define MCTM private definitions
  * @{
  */
#define CNTCFR_UEV1DIS      0x01
#define CNTCFR_UGDIS        0x02
#define CNTCFR_DIR          0x01000000
#define CNTCFR_CMSEL_MASK   ~0x00030000ul
#define CNTCFR_CKDIV_MASK   ~0x00000300ul

#define MDCFR_SPMSET        0x01000000
#define MDCFR_TSE           0x01
#define MDCFR_SMSEL_MASK    ~0x00000700ul
#define MDCFR_MMSEL_MASK    ~0x00070000ul

#define TRCFR_ECME          0x01000000
#define TRCFR_ETI_POL       0x00010000
#define TRCFR_ETI_PSC_MASK  ~0x00003000ul
#define TRCFR_ETIF_MASK     ~0x00000F00ul
#define TRCFR_TRSEL_MASK    ~0x0000000Ful
#define TRCFR_ETI_CONF_MASK ~0x00013F00ul

#define CTR_TME             0x00000001ul
#define CTR_CRBE            0x00000002ul
#define CTR_COMPRE          0x00000100ul
#define CTR_COMUS           0x00000200ul
#define CTR_CHCCDS          0x00010000ul

#define CH0ICFR_CH0SRC      0x80000000
#define CHICFR_CHF_MASK     ~0x0000000Ful
#define CHICFR_CHCCS_MASK   ~0x00030000ul
#define CHICFR_CHPSC_MASK   ~0x000C0000ul

#define CHOCFR_REFCE        0x08
#define CHOCFR_CHPRE        0x10
#define CHOCFR_IMAE         0x20
#define CHOCFR_CHOM_MASK    ~0x07ul

#define CHPOLR_CH0P         0x1
#define CHPOLR_CH1P         0x4

#define CHBRKCTR_CHMOE      0x00000010ul

/**
  * @}
  *//* End of MCTM_Private_Define group */

/** @defgroup MCTM_Private_Function_Prototype MCTM private function prototypes
  * @{
  */
static void
mctm_CHx_Config(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Ch, MCTM_CHP_Enum Pol,
                MCTM_CHCCS_Enum Sel, u8 Filter) ;
/**
  * @}
  *//* End of MCTM_Private_Function_Prototype group */

/** @defgroup MCTM_Private_Function MCTM private functions
  * @{
  */

/*********************************************************************************************************//**
 * @brief Deinitialize the MCTMx peripheral registers to their default reset values.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @retval None
 ************************************************************************************************************/
void MCTM_DeInit(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  if(MCTMx == MCTM)
  {
    RSTCU_APBPerip1Reset(RSTCU_APBRST1_MCTM, ENABLE);
  }
}

/*********************************************************************************************************//**
 * @brief Initialize the MCTM counter to reload, prescaler, counter mode and repetition counter.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param TimeBaseInit: Point to a \ref MCTM_TimeBaseInitTypeDef that contains the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimeBaseInit(MCTM_TypeDef* MCTMx, MCTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CNT_MODE(TimeBaseInit->CounterMode));
  Assert_Param(IS_MCTM_PSC_RLD(TimeBaseInit->PSCReloadTime));

  /* Set the counter reload value */
  MCTMx->CRR = TimeBaseInit->CounterReload ;

  /* Set the Prescaler value */
  MCTMx->PSCR = TimeBaseInit->Prescaler;

  /* Select the Counter Mode */
  MCTMx->CNTCFR &= CNTCFR_CMSEL_MASK & ~CNTCFR_DIR;
  MCTMx->CNTCFR |= TimeBaseInit->CounterMode;

  /* Set the Repetition value */
  MCTMx->REPR = TimeBaseInit->RepetitionCounter;

  /* To reload the Prescaler value immediatly or next update event 1 */
  MCTMx->EVGR = TimeBaseInit->PSCReloadTime;
}

/*********************************************************************************************************//**
 * @brief Initialize the MCTMx channel x output.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param OutInit: Point to a \ref MCTM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void MCTM_OutputInit(MCTM_TypeDef* MCTMx, MCTM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&MCTMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&MCTMx->CH0CCR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask = ~(0x3ul << bChPos);
  u32 wTmpReg;

  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(OutInit->Channel));
  Assert_Param(IS_MCTM_OM(OutInit->OutputMode));
  Assert_Param(IS_MCTM_CHCTL(OutInit->Control));
  Assert_Param(IS_MCTM_CHCTL(OutInit->ControlN));
  Assert_Param(IS_MCTM_CHP(OutInit->Polarity));
  Assert_Param(IS_MCTM_CHP(OutInit->PolarityN));
  Assert_Param(IS_MCTM_OIS(OutInit->IdleState));
  Assert_Param(IS_MCTM_OIS(OutInit->IdleStateN));

  /* Disable the Channel */
  MCTMx->CHCTR &= wTmpMask;

  /* Set the Output Compare Polarity */
  wTmpReg = MCTMx->CHPOLR & wTmpMask;
  wTmpReg |= (u32)(OutInit->Polarity | (OutInit->PolarityN << 1)) << bChPos;
  MCTMx->CHPOLR = wTmpReg;

