Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
  /* Set the Output Idle State */
  wTmpReg = MCTMx->CHBRKCFR & wTmpMask;
  wTmpReg |= (u32)(OutInit->IdleState | (OutInit->IdleStateN << 1)) << bChPos;
  MCTMx->CHBRKCFR = wTmpReg;

  /* Select the Output Compare Mode */
  *pOcfr &= CHOCFR_CHOM_MASK;
  *pOcfr |= OutInit->OutputMode;

  /* Set the Capture Compare Register value */
  *pCcr = OutInit->Compare;

  /* Set the channel state */
  MCTMx->CHCTR |= (u32)(OutInit->Control | (OutInit->ControlN << 1)) << bChPos;
}

/*********************************************************************************************************//**
 * @brief Initialize input capture of the MCTM channel.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void MCTM_CaptureInit(MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(CapInit->Channel));
  Assert_Param(IS_MCTM_CHP(CapInit->Polarity));
  Assert_Param(IS_MCTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_MCTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_MCTM_FILTER(CapInit->Filter));

  mctm_CHx_Config(MCTMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter) ;

  /* Set the Input Capture Prescaler value */
  MCTM_CHPSCConfig(MCTMx, CapInit->Channel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Configure the MCTM to measure an external PWM signal.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void MCTM_PwmInputInit(MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit)
{
  MCTM_CHP_Enum OppositePol = MCTM_CHP_NONINVERTED;
  MCTM_CHCCS_Enum OppositeSel = MCTM_CHCCS_DIRECT;

  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_MCTM_CHP(CapInit->Polarity));
  Assert_Param(IS_MCTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_MCTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_MCTM_FILTER(CapInit->Filter));

  /* Select the Opposite Input Polarity */
  if (CapInit->Polarity == MCTM_CHP_NONINVERTED)
  {
    OppositePol = MCTM_CHP_INVERTED;
  }
  else
  {
    OppositePol = MCTM_CHP_NONINVERTED;
  }

  /* Select the Opposite Input */
  if (CapInit->Selection == MCTM_CHCCS_DIRECT)
  {
    OppositeSel = MCTM_CHCCS_INDIRECT;
  }
  else
  {
    OppositeSel = MCTM_CHCCS_DIRECT;
  }

  if (CapInit->Channel == MCTM_CH_0)
  {
    /* CH0 Configuration */
    mctm_CHx_Config(MCTMx, MCTM_CH_0, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

    /* Set the Input Capture Prescaler value */
    MCTM_CHPSCConfig(MCTMx, MCTM_CH_0, CapInit->Prescaler);

    /* CH1 Configuration */
    mctm_CHx_Config(MCTMx, MCTM_CH_1, OppositePol, OppositeSel, CapInit->Filter) ;

    /* Set the Input Capture Prescaler value */
    MCTM_CHPSCConfig(MCTMx, MCTM_CH_1, CapInit->Prescaler);
  }
  else
  {
    /* CH1 Configuration */
    mctm_CHx_Config(MCTMx, MCTM_CH_1, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

    /* Set the Input Capture Prescaler value */
    MCTM_CHPSCConfig(MCTMx, MCTM_CH_1, CapInit->Prescaler);

    /* CH0 Configuration */
    mctm_CHx_Config(MCTMx, MCTM_CH_0, OppositePol, OppositeSel, CapInit->Filter) ;

    /* Set the Input Capture Prescaler value */
    MCTM_CHPSCConfig(MCTMx, MCTM_CH_0, CapInit->Prescaler);
  }
}

/*********************************************************************************************************//**
 * @brief Fill each TimeBaseInit member with its default value.
 * @param TimeBaseInit: Point to a \ref MCTM_TimeBaseInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimeBaseStructInit(MCTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Set the default configuration */
  TimeBaseInit->CounterMode = MCTM_CNT_MODE_UP;
  TimeBaseInit->CounterReload = 0xFFFF;
  TimeBaseInit->Prescaler = 0x0000;
  TimeBaseInit->PSCReloadTime = MCTM_PSC_RLD_IMMEDIATE;
  TimeBaseInit->RepetitionCounter = 0;
}

/*********************************************************************************************************//**
 * @brief Fill each OutInit member with its default value.
 * @param OutInit: Point to a \ref MCTM_OutputInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_OutputStructInit(MCTM_OutputInitTypeDef* OutInit)
{
  /* Set the default configuration */
  OutInit->Channel = MCTM_CH_0;
  OutInit->OutputMode = MCTM_OM_MATCH_NOCHANGE;
  OutInit->Control = MCTM_CHCTL_DISABLE;
  OutInit->ControlN = MCTM_CHCTL_DISABLE;
  OutInit->Polarity = MCTM_CHP_NONINVERTED;
  OutInit->PolarityN = MCTM_CHP_NONINVERTED;
  OutInit->IdleState = MCTM_OIS_LOW;
  OutInit->IdleStateN = MCTM_OIS_LOW;
  OutInit->Compare = 0x0000;
}

/*********************************************************************************************************//**
 * @brief Fill each CapInit member with its default value.
 * @param CapInit: Point to a \ref MCTM_CaptureInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void MCTM_CaptureStructInit(MCTM_CaptureInitTypeDef* CapInit)
{
  /* Set the default configuration */
  CapInit->Channel = MCTM_CH_0;
  CapInit->Polarity = MCTM_CHP_NONINVERTED;
  CapInit->Selection = MCTM_CHCCS_DIRECT;
  CapInit->Prescaler = MCTM_CHPSC_OFF;
  CapInit->Filter = 0x00;
}

