Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
/*********************************************************************************************************//**
 * @brief Enable or Disable MCTM counter.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_Cmd(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the MCTM Counter */
    MCTMx->CTR |= CTR_TME;
  }
  else
  {
    /* Disable the MCTM Counter */
    MCTMx->CTR &= ~(u32)CTR_TME;
  }
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the MCTM. Used ITIx as the clock source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Iti: Trigger source.
 *        This parameter can be one of the following values:
 *        @arg MCTM_TRSEL_ITI1: Internal trigger 1
 *        @arg MCTM_TRSEL_ITI2: Internal trigger 2
 * @retval None
 ************************************************************************************************************/
void MCTM_ItiExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Iti)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_ITI(Iti));

  /* Select the Internal Trigger. Slave mode will be disable in this function*/
  MCTM_StiConfig(MCTMx, Iti);

  /* Select the STIED as external clock source */
  MCTMx->MDCFR |= MCTM_SMSEL_STIED;
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the MCTM . Used CHx as the clock source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the channel source.
 *        This parameter can be one of the following values:
 *        @arg MCTM_TRSEL_TI0BED : TI0 both edge detector
 *        @arg MCTM_TRSEL_TI0S0 : Filtered timer input 0
 *        @arg MCTM_TRSEL_TI1S1 : Filtered timer input 1
 * @param Pol: Specify the CHx Polarity.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHP_NONINVERTED : active high.
 *        @arg MCTM_CHP_INVERTED    : active low.
 * @param Filter: Specify the filter value.
 *        This parameter must be a value between 0x0 and 0xF.
 * @retval None
 ************************************************************************************************************/
void MCTM_ChExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Sel, MCTM_CHP_Enum Pol, u8 Filter)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_TRSEL_CH(Sel));
  Assert_Param(IS_MCTM_CHP(Pol));
  Assert_Param(IS_MCTM_FILTER(Filter));

  /* Configure the Timer Input Clock Source */
  if (Sel == MCTM_TRSEL_TI1S1)
  {
    mctm_CHx_Config(MCTMx, MCTM_CH_1, Pol, MCTM_CHCCS_DIRECT, Filter);
  }
  else
  {
    mctm_CHx_Config(MCTMx, MCTM_CH_0, Pol, MCTM_CHCCS_DIRECT, Filter);
  }

  /* Select the external clock source. Slave mode will be disable in this function */
  MCTM_StiConfig(MCTMx, Sel);

  /* Select the STIED as external clock source */
  MCTMx->MDCFR |= MCTM_SMSEL_STIED;
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the MCTM. Used ETI as the clock source.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPSC_OFF : ETI prescaler off
 *        @arg MCTM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg MCTM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg MCTM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void MCTM_EtiExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_ETIPSC_Enum Psc, MCTM_ETIPOL_Enum Pol, u8 Filter)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_ETIPSC(Psc));
  Assert_Param(IS_MCTM_ETIPOL(Pol));
  Assert_Param(IS_MCTM_FILTER(Filter));

  /* Configure the ETI Clock source */
  MCTM_EtiConfig(MCTMx, Psc, Pol, Filter);

  /* Enable the external clock mode */
  MCTMx->TRCFR |= TRCFR_ECME;
}

/*********************************************************************************************************//**
 * @brief Configure external trigger input (ETI) of the MCTMx .
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Psc: The external Trigger Prescaler.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPSC_OFF : ETI prescaler off
 *        @arg MCTM_ETIPSC_2   : ETIP frequency divided by 2
 *        @arg MCTM_ETIPSC_4   : ETIP frequency divided by 4
 *        @arg MCTM_ETIPSC_8   : ETIP frequency divided by 8
 * @param Pol: The external trigger input polarity.
 *        It can be one of the following values:
 *        @arg MCTM_ETIPOL_NONINVERTED : Active high level or rising edge
 *        @arg MCTM_ETIPOL_INVERTED    : Active low level or falling edge
 * @param Filter: Filter for ETI input.
 *        This parameter must be a value between 0x00 and 0x0F
 * @retval None
 ************************************************************************************************************/
void MCTM_EtiConfig(MCTM_TypeDef* MCTMx, MCTM_ETIPSC_Enum Psc, MCTM_ETIPOL_Enum Pol, u8 Filter)
{
  u32 wTrcfr ;

  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_ETIPSC(Psc));
  Assert_Param(IS_MCTM_ETIPOL(Pol));
  Assert_Param(IS_MCTM_FILTER(Filter));

