Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
/*********************************************************************************************************//**
 * @brief Configure ouput mode of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Channel: Specify the MCTM channel.
 *        This parmeter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Mod: Specify the MCTM output mode.
 *        This paramter can be one of the following values:
 *        @arg MCTM_OM_MATCH_NOCHANGE  : Output dont change on match
 *        @arg MCTM_OM_MATCH_INACTIVE  : Output inactive on compare match
 *        @arg MCTM_OM_MATCH_ACTIVE    : Output active on compare match
 *        @arg MCTM_OM_MATCH_TOGGLE    : Output toggle on compare match
 *        @arg MCTM_OM_FORCED_INACTIVE : Output forced inactive
 *        @arg MCTM_OM_FORCED_ACTIVE   : Output forced active
 *        @arg MCTM_OM_PWM1            : PWM1 mode
 *        @arg MCTM_OM_PWM2            : PWM2 mode
 * @retval None
 * @note This function disables the selected channel before changing the output mode.
 ************************************************************************************************************/
void MCTM_OutputModeConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_OM_Enum Mod)
{
  vu32 *pOcfr = (vu32*)&MCTMx->CH0OCFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(Channel));
  Assert_Param(IS_MCTM_OM(Mod));

  /* Disable the channel: Reset the CHxE Bit */
  MCTMx->CHCTR &= ~(u32)(0x1 << (Channel << 1));

  /* Selects the MCTM ouput mode. */
  *pOcfr = (*pOcfr & CHOCFR_CHOM_MASK) | Mod ;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable update event of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE(default) or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_UpdateCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the update disable bit */
    MCTMx->CNTCFR |= CNTCFR_UEV1DIS;
  }
  else
  {
    /* Reset the update disable bit */
    MCTMx->CNTCFR &= ~(u32)CNTCFR_UEV1DIS;
  }
}

/*********************************************************************************************************//**
 * @brief Configure UEV1G interrupt function of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be one of the following value:
 *    @arg ENABLE  : Default value. Any of the following events will generate an update event 1 interrupt:
 *                   - Counter overflow/underflow
 *                   - Setting the UEV1G bit
 *                   - Update generation through the slave restart mode
 *    @arg DISABLE : Only counter overflow/underflow generations an update event 1 interrupt.
 * @retval None
 ************************************************************************************************************/
void MCTM_UEV1G_IntConfig(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState == DISABLE)
  {
    /* Set the UEV1G interrupt disable bit */
    MCTMx->CNTCFR |= CNTCFR_UGDIS;
  }
  else
  {
    /* Reset the UEV1G interrupt disable bit */
    MCTMx->CNTCFR &= ~(u32)CNTCFR_UGDIS;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable hall sensor interface of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_HallInterfaceCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CH0SRC Bit */
    MCTMx->CH0ICFR |= CH0ICFR_CH0SRC;
  }
  else
  {
    /* Reset the CH0SRC Bit */
    MCTMx->CH0ICFR &= ~(u32)CH0ICFR_CH0SRC;
  }
}

/*********************************************************************************************************//**
 * @brief Select single pulse mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_SinglePulseModeCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if(NewState != DISABLE)
  {
    MCTMx->MDCFR |= MDCFR_SPMSET;
  }
  else
  {
    MCTMx->MDCFR &= ~(u32)MDCFR_SPMSET;
  }
}

/*********************************************************************************************************//**
 * @brief Select master trigger output source of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the master trigger output source.
 *        This paramter can be as follow:
 *        @arg MCTM_MMSEL_RESET   : Send trigger signal when S/W setting UEV1G or slave restart
 *        @arg MCTM_MMSEL_ENABLE  : The counter enable signal is used as trigger output.
 *        @arg MCTM_MMSEL_UPDATE  : The update event 1 is used as trigger output.
 *        @arg MCTM_MMSEL_CH0CC   : Channel 0 capture or compare match occurred as trigger output.
 *        @arg MCTM_MMSEL_CH0OREF : The CH0OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH1OREF : The CH1OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH2OREF : The CH2OREF signal is used as trigger output.
 *        @arg MCTM_MMSEL_CH3OREF : The CH3OREF signal is used as trigger output.
 * @retval None
 ************************************************************************************************************/
void MCTM_MMSELConfig(MCTM_TypeDef* MCTMx, MCTM_MMSEL_Enum Sel)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_MMSEL(Sel));

