Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
  /* Select the MTO source */
  MCTMx->MDCFR = (MCTMx->MDCFR & MDCFR_MMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Select slave mode of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Sel: Specify the timer slave mode.
 *        This paramter can be one of the following values:
 *        @arg MCTM_SMSEL_RESTART : Slave restart counter mode.
 *        @arg MCTM_SMSEL_PAUSE   : Slave pause counter mode.
 *        @arg MCTM_SMSEL_TRIGGER : Slave trigger counter start mode.
 *        @arg MCTM_SMSEL_STIED   : Used rising edge of STI as prescaler clock source.
 * @retval None
 ************************************************************************************************************/
void MCTM_SlaveModeConfig(MCTM_TypeDef* MCTMx, MCTM_SMSEL_Enum Sel)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_SLAVE_MODE(Sel));

  /* Select the slave mode */
  MCTMx->MDCFR = (MCTMx->MDCFR & MDCFR_SMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the master & slave MCTM synchronous function.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void MCTM_TimSyncCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TSE Bit */
    MCTMx->MDCFR |= MDCFR_TSE ;
  }
  else
  {
    /* Reset the TSE Bit */
    MCTMx->MDCFR &= ~(u32)MDCFR_TSE ;
  }
}

/*********************************************************************************************************//**
 * @brief Set counter register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCounter(MCTM_TypeDef* MCTMx, u16 Counter)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the Counter Register value */
  MCTMx->CNTR = Counter;
}

/*********************************************************************************************************//**
 * @brief Set counter reload register value of the MCTMx .
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCounterReload(MCTM_TypeDef* MCTMx, u16 Reload)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the counter reload register value */
  MCTMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare0(MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH0CCR register new value */
  MCTMx->CH0CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare1(MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH1CCR register new value */
  MCTMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare2(MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH2CCR register new value */
  MCTMx->CH2CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the MCTMx .
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void MCTM_SetCaptureCompare3(MCTM_TypeDef* MCTMx, u16 Cmp)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Set the CH3CCR register new value */
  MCTMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Channel: Specify the MCTM channel.
 *        This parmeter can be one of the following values:
 *        @arg MCTM_CH_0 : MCTM channel 0
 *        @arg MCTM_CH_1 : MCTM channel 1
 *        @arg MCTM_CH_2 : MCTM channel 2
 *        @arg MCTM_CH_3 : MCTM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg MCTM_CHPSC_OFF : No prescaler
 *        @arg MCTM_CHPSC_2   : Capture is done once every 2 events
 *        @arg MCTM_CHPSC_4   : Capture is done once every 4 events
 *        @arg MCTM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void MCTM_CHPSCConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&MCTMx->CH0ICFR + Channel ;

  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CH(Channel));
  Assert_Param(IS_MCTM_CHPSC(Psc));

  /* Reset the CHxPSC bits */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value */
  *pIcfr |= Psc;
}

