Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_mctm.c
/*********************************************************************************************************//**
 * @brief Set clock division value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg MCTM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg MCTM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg MCTM_CKDIV_4   : fDTS = fCLKIN / 4
 * @retval None
 ************************************************************************************************************/
void MCTM_CKDIVConfig(MCTM_TypeDef* MCTMx, MCTM_CKDIV_Enum Div)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_CKDIV(Div));

  /* Reset the CKDIV Bits */
  MCTMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value */
  MCTMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel 0 capture/compare register value of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH0CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare0(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH0CCR register value */
  return MCTMx->CH0CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 1 capture/compare register value of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH1CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare1(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH1CCR register value */
  return MCTMx->CH1CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 2 capture/compare register value of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH2CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare2(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH2CCR register value */
  return MCTMx->CH2CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 3 capture/compare register value of the MCTM.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of CH3CCR register
 ************************************************************************************************************/
u32 MCTM_GetCaptureCompare3(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the CH3CCR register value */
  return MCTMx->CH3CCR;
}

/*********************************************************************************************************//**
 * @brief Get counter value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of Counter register
 ************************************************************************************************************/
u32 MCTM_GetCounter(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the Counter Register value */
  return MCTMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the MCTMx.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @return Value of Prescaler register
 ************************************************************************************************************/
u32 MCTM_GetPrescaler(MCTM_TypeDef* MCTMx)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));

  /* Get the Prescaler Register value */
  return MCTMx->PSCR;
}

/*********************************************************************************************************//**
 * @brief Generate MCTM events.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg MCTM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg MCTM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg MCTM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg MCTM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg MCTM_EVENT_UEV1      : Timer update event 1
 *        @arg MCTM_EVENT_UEV2      : Timer update event 2
 *        @arg MCTM_EVENT_TEV       : Timer trigger event
 *        @arg MCTM_EVENT_BRKEV     : Timer break event
 * @retval None
 ************************************************************************************************************/
void MCTM_GenerateEvent(MCTM_TypeDef* MCTMx, u32 MCTM_EVENT)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_EVENT(MCTM_EVENT));

  /* Set the event sources */
  MCTMx->EVGR = MCTM_EVENT;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified MCTM flag has been set.
 * @param MCTMx: where MCTMx is the selected MCTM from the MCTM peripheral.
 * @param MCTM_FLAG: Specify the flag to check.
 *        This parameter can be one of the following values:
 *        @arg MCTM_FLAG_CH0CC    : MCTM Capture/compare 0 flag
 *        @arg MCTM_FLAG_CH1CC    : MCTM Capture/compare 1 flag
 *        @arg MCTM_FLAG_CH2CC    : MCTM Capture/compare 2 flag
 *        @arg MCTM_FLAG_CH3CC    : MCTM Capture/compare 3 flag
 *        @arg MCTM_FLAG_CH0OC    : MCTM channel 0 overcapture flag
 *        @arg MCTM_FLAG_CH1OC    : MCTM channel 1 overcapture flag
 *        @arg MCTM_FLAG_CH2OC    : MCTM channel 2 overcapture flag
 *        @arg MCTM_FLAG_CH3OC    : MCTM channel 3 overcapture flag
 *        @arg MCTM_FLAG_UEV1     : MCTM update 1 flag
 *        @arg MCTM_FLAG_UEV2     : MCTM update 2 flag
 *        @arg MCTM_FLAG_TEV      : MCTM trigger flag
 *        @arg MCTM_FLAG_BRKEV    : MCTM break flag
 * @return The new state of MCTM_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus MCTM_GetFlagStatus(MCTM_TypeDef* MCTMx, u32 MCTM_FLAG)
{
  /* Check the parameters */
  Assert_Param(IS_MCTM(MCTMx));
  Assert_Param(IS_MCTM_FLAG(MCTM_FLAG));

  if ((MCTMx->INTSR & MCTM_FLAG) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

